In [50]:
import pandas as pd
import numpy as np
import seaborn as sns
from jupyter_core.migrate import regex

In [51]:
df = pd.read_csv('Travel details dataset.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 139 entries, 0 to 138
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Trip ID               139 non-null    int64
 1   Destination           137 non-null    object
 2   Start date            137 non-null    object
 3   End date              137 non-null    object
 4   Duration (days)       137 non-null    float64
 5   Traveler name         137 non-null    object
 6   Traveler age          137 non-null    float64
 7   Traveler gender       137 non-null    object
 8   Traveler nationality  137 non-null    object
 9   Accommodation type    137 non-null    object
 10  Accommodation cost    137 non-null    object
 11  Transportation type   136 non-null    object
 12  Transportation cost   136 non-null    object
dtypes: float64(2), int64(1), object(10)
memory usage: 14.2+ KB

In [52]:
df.isna().sum()

Trip ID                 0
Destination             2
Start date              2
End date                2
Duration (days)         2
Traveler name           2
Traveler age            2
Traveler gender         2
Traveler nationality    2
Accommodation type      2
Accommodation cost      2
Transportation type     3
Transportation cost     3
dtype: int64

In [53]:
df.dropna(inplace=True)

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 136 entries, 0 to 138
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Trip ID               136 non-null    int64
 1   Destination           136 non-null    object
 2   Start date            136 non-null    object
 3   End date              136 non-null    object
 4   Duration (days)       136 non-null    float64
 5   Traveler name         136 non-null    object
 6   Traveler age          136 non-null    float64
 7   Traveler gender       136 non-null    object
 8   Traveler nationality  136 non-null    object
 9   Accommodation type    136 non-null    object
 10  Accommodation cost    136 non-null    object
 11  Transportation type   136 non-null    object
 12  Transportation cost   136 non-null    object
dtypes: float64(2), int64(1), object(10)
memory usage: 14.9+ KB

In [55]:
df.head()

,Trip ID,Destination,Start date,End date,Duration (days),Traveler name,Traveler age,Traveler gender,Traveler nationality,Accommodation type,Accommodation cost,Transportation type,Transportation cost
0,1,"London, UK",5/1/2023,5/8/2023,7.0,John Smith,35.0,Male,American,Hotel,1200,Flight,600
1,2,"Phuket, Thailand",6/15/2023,6/20/2023,5.0,Jane Doe,28.0,Female,Canadian,Resort,800,Flight,500
2,3,"Bali, Indonesia",7/1/2023,7/8/2023,7.0,David Lee,45.0,Male,Korean,Villa,1000,Flight,700
3,4,"New York, USA",8/15/2023,8/29/2023,14.0,Sarah Johnson,29.0,Female,British,Hotel,2000,Flight,1000
4,5,"Tokyo, Japan",9/10/2023,9/17/2023,7.0,Kim Nguyen,26.0,Female,Vietnamese,Airbnb,700,Train,200

In [64]:
df['Duration (days)'] = df['Duration (days)'].astype(int)
df['Start date'] = pd.to_datetime(df['Start date'])
df['End date'] = pd.to_datetime(df['End date'])


df['Accommodation cost'] = df['Accommodation cost'].astype(str).str.replace('$', '', regex=False)
df['Accommodation cost'] = df['Accommodation cost'].str.replace(',', '', regex=False)
df['Accommodation cost'] = df['Accommodation cost'].str.replace('USD', '', regex=False)
df['Accommodation cost'] = df['Accommodation cost'].astype(int)


df['Transportation cost'] = df['Transportation cost'].astype(str).str.replace('$', '', regex=False)
df['Transportation cost'] = df['Transportation cost'].str.replace(',', '', regex=False)
df['Transportation cost'] = df['Transportation cost'].str.replace('USD', '', regex=False)
df['Transportation cost'] = df['Transportation cost'].astype(int)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 136 entries, 0 to 138
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Trip ID               136 non-null    int64
 1   Destination           136 non-null    object
 2   Start date            136 non-null    datetime64[ns]
 3   End date              136 non-null    datetime64[ns]
 4   Duration (days)       136 non-null    int64
 5   Traveler name         136 non-null    object
 6   Traveler age          136 non-null    float64
 7   Traveler gender       136 non-null    object
 8   Traveler nationality  136 non-null    object
 9   Accommodation type    136 non-null    object
 10  Accommodation cost    136 non-null    int64
 11  Transportation type   136 non-null    object
 12  Transportation cost   136 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(3), object(7)
memory usage: 14.9+ KB

In [65]:
df.describe()

,Trip ID,Start date,End date,Duration (days),Traveler age,Accommodation cost,Transportation cost
count,136.000000,136,136,136.000000,136.000000,136.000000,136.000000
mean,69.463235,2023-04-30 19:56:28.235294208,2023-05-08 08:49:24.705882368,7.610294,33.117647,1253.529412,645.183824
min,1.000000,2021-06-15 00:00:00,2021-06-20 00:00:00,5.000000,20.000000,150.000000,20.000000
25%,34.750000,2022-08-30 06:00:00,2022-09-08 00:00:00,7.000000,28.000000,600.000000,200.000000
50%,68.500000,2023-06-11 00:00:00,2023-06-17 00:00:00,7.000000,31.000000,900.000000,550.000000
75%,104.250000,2023-11-20 00:00:00,2023-11-26 06:00:00,8.000000,37.250000,1200.000000,800.000000
max,139.000000,2025-05-21 00:00:00,2025-05-29 00:00:00,14.000000,60.000000,8000.000000,3000.000000
std,40.388284,NaN,NaN,1.606343,7.139933,1338.644162,584.476153